In [31]:
import pandas as pd
import numpy as np

In [32]:
df = pd.DataFrame({
    "Name": ["Alice", "Bob"],
    "Cgpa": [9.5, 8.7]  
})
print(df)

    Name  Cgpa
0  Alice   9.5
1    Bob   8.7

In [33]:
df

    Name  Cgpa
0  Alice   9.5
1    Bob   8.7

In [34]:
s = pd.Series([1, 2, 3, 4, 5], index = ["a","b","c","d","e"])  
print(s)
print(type(s))
print(s[0])    # 1
print(s[2])    # 3
print(s.index)

a    1
b    2
c    3
d    4
e    5
dtype: int64
<class 'pandas.core.series.Series'>
1
3
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

C:\Users\Amanm\AppData\Local\Temp\ipykernel_13888\2689259937.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[0])    # 1
C:\Users\Amanm\AppData\Local\Temp\ipykernel_13888\2689259937.py:5: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[2])    # 3

In [35]:
#Read the csv file
df = pd.read_csv("employee_data.csv")
print(df, type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [36]:
#Read the json file
df = pd.read_json("Sample.json")
print(df, type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
 <class 'pandas.core.frame.DataFrame'>

In [37]:
df = pd.read_csv("globalAirQuality.csv")

df

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
0,2025-11-04 18:25:17.554219,US,New York,40.713,-74.006,50.295,108.938,27.998,6.539,52.568,1.096,108,18.504,70.168,3.725
1,2025-11-04 19:25:17.554219,US,New York,40.713,-74.006,32.083,63.043,36.120,4.021,43.536,1.075,90,5.838,80.088,8.969
2,2025-11-04 20:25:17.554219,US,New York,40.713,-74.006,42.250,82.553,26.935,9.538,23.320,0.977,84,31.833,62.783,9.650
3,2025-11-04 21:25:17.554219,US,New York,40.713,-74.006,30.403,79.951,63.536,7.609,31.369,0.230,158,23.140,89.153,8.956
4,2025-11-04 22:25:17.554219,US,New York,40.713,-74.006,21.083,66.423,38.997,6.919,45.615,1.085,97,13.632,76.499,4.017
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17995,2025-11-19 13:25:17.554219,CH,Zurich,47.377,8.542,27.899,74.179,41.474,6.677,50.869,1.028,103,7.079,52.443,7.452
17996,2025-11-19 14:25:17.554219,CH,Zurich,47.377,8.542,2.950,47.988,42.235,2.821,35.551,0.644,105,28.734,85.678,4.496
17997,2025-11-19 15:25:17.554219,CH,Zurich,47.377,8.542,61.347,72.908,46.976,5.763,66.492,0.947,122,21.951,72.311,9.660
17998,2025-11-19 16:25:17.554219,CH,Zurich,47.377,8.542,40.722,95.152,32.957,5.524,53.193,0.868,95,24.042,31.880,2.642
17999,2025-11-19 17:25:17.554219,CH,Zurich,47.377,8.542,25.830,30.411,35.317,4.336,66.246,0.848,88,8.529,59.104,4.403

In [38]:
#Selecting the columns
df.loc[0,"country"]

'US'

In [39]:
df[(df["temperature"]>25)&(df["aqi"] > 130)]

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
6,2025-11-05 00:25:17.554219,US,New York,40.713,-74.006,77.690,65.198,20.302,7.641,62.687,0.734,155,36.729,47.651,4.542
44,2025-11-06 14:25:17.554219,US,New York,40.713,-74.006,78.186,114.005,17.993,5.932,18.151,0.845,156,31.779,49.093,8.211
53,2025-11-06 23:25:17.554219,US,New York,40.713,-74.006,76.530,35.490,38.587,5.023,38.581,0.679,153,28.228,50.499,3.611
65,2025-11-07 11:25:17.554219,US,New York,40.713,-74.006,0.219,69.858,55.764,6.026,21.694,0.925,139,27.463,25.437,0.579
85,2025-11-08 07:25:17.554219,US,New York,40.713,-74.006,20.755,90.684,58.253,10.894,52.728,0.831,145,28.571,39.585,6.231
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17950,2025-11-17 16:25:17.554219,CH,Zurich,47.377,8.542,70.255,60.620,32.081,2.065,47.803,0.852,140,36.885,34.173,1.748
17959,2025-11-18 01:25:17.554219,CH,Zurich,47.377,8.542,69.826,90.040,26.413,3.524,42.637,0.997,139,27.633,27.950,8.830
17968,2025-11-18 10:25:17.554219,CH,Zurich,47.377,8.542,27.063,143.148,34.420,2.708,44.276,0.565,143,28.369,60.224,0.645
17970,2025-11-18 12:25:17.554219,CH,Zurich,47.377,8.542,53.113,60.361,56.715,2.268,33.839,0.134,141,28.966,84.326,4.661
17976,2025-11-18 18:25:17.554219,CH,Zurich,47.377,8.542,73.493,89.558,9.313,4.768,51.505,0.745,146,30.909,81.573,1.024

In [40]:
aqi_data = df[(df["aqi"] >30) & (df["temperature"] > 30)][["city","aqi"] ]
aqi_data

#query
aqi_val = 100
aqi_data = df.query("aqi > @aqi_val & temperature > 30")[["city","aqi"]].copy()
aqi_data

           city  aqi
6      New York  155
7      New York  115
14     New York  121
17     New York  127
25     New York  113
...         ...  ...
17947    Zurich  107
17950    Zurich  140
17975    Zurich  111
17976    Zurich  146
17991    Zurich  104

[2384 rows x 2 columns]

In [41]:
# Cleaning Data
df = pd.read_csv("raw_data.csv")
df2 = df.copy()
df2["tax"] = df2["income"].apply(lambda x : "20%" if x >= 60000 else"10%")
df2

    id          name   age country   gender   income  tax
0    1      John Doe  29.0     USA     Male  55000.0  10%
1    1      John Doe  29.0     USA     Male  55000.0  10%
2    2    Jane Smith   NaN  Canada   Female  62000.0  20%
3    3          Alex   NaN     USA  Unknown  47000.0  10%
4    4  Maria Garcia  34.0   Spain   Female      NaN  10%
5    5        Li Wei  27.0   China     Male  51000.0  10%
6    6           NaN  45.0   India   Female  73000.0  20%
7    7    Ahmed Khan  38.0     NaN     Male  68000.0  20%
8    8    Rachel Lee  29.0     USA   Female  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0  10%
10  10   Emily Davis  31.0     USA      NaN  58000.0  10%

In [42]:
df2 = df.copy()

new_col_order = [col for col in df2.columns if col != "id" ] + ["id"]
print (new_col_order)
df[new_col_order]

['name', 'age', 'country', 'gender', 'income', 'id']

            name   age country   gender   income  id
0       John Doe  29.0     USA     Male  55000.0   1
1       John Doe  29.0     USA     Male  55000.0   1
2     Jane Smith   NaN  Canada   Female  62000.0   2
3           Alex   NaN     USA  Unknown  47000.0   3
4   Maria Garcia  34.0   Spain   Female      NaN   4
5         Li Wei  27.0   China     Male  51000.0   5
6            NaN  45.0   India   Female  73000.0   6
7     Ahmed Khan  38.0     NaN     Male  68000.0   7
8     Rachel Lee  29.0     USA   Female  62000.0   8
9    Carlos Ruiz   NaN  Mexico     Male  45000.0   9
10   Emily Davis  31.0     USA      NaN  58000.0  10

In [43]:
df2 = df.copy()

df2 = df2.drop_duplicates()
df2 = df2.fillna(0)

df2= df2.sort_values("income")

df2= df2.reset_index(drop = True)
df2.to_csv("sorted_data.csv")
df2

   id          name   age country   gender   income
0   4  Maria Garcia  34.0   Spain   Female      0.0
1   9   Carlos Ruiz   0.0  Mexico     Male  45000.0
2   3          Alex   0.0     USA  Unknown  47000.0
3   5        Li Wei  27.0   China     Male  51000.0
4   1      John Doe  29.0     USA     Male  55000.0
5  10   Emily Davis  31.0     USA        0  58000.0
6   2    Jane Smith   0.0  Canada   Female  62000.0
7   8    Rachel Lee  29.0     USA   Female  62000.0
8   7    Ahmed Khan  38.0       0     Male  68000.0
9   6             0  45.0   India   Female  73000.0

In [44]:
df = pd.DataFrame({
    "country": ["USA", "USA", "India", "India"],
    "year": [2020, 2021, 2020, 2021],
    "sales": [100, 120, 90, 110],
    "profit": [20, 25, 18, 22],
    "tax" : [10,20,30,40]
})

df.melt(
    id_vars = ["country","year"],
    value_vars =["sales","profit","tax"],
    var_name = "matrix",
    value_name = "value"
)

   country  year  matrix  value
0      USA  2020   sales    100
1      USA  2021   sales    120
2    India  2020   sales     90
3    India  2021   sales    110
4      USA  2020  profit     20
5      USA  2021  profit     25
6    India  2020  profit     18
7    India  2021  profit     22
8      USA  2020     tax     10
9      USA  2021     tax     20
10   India  2020     tax     30
11   India  2021     tax     40